x1=[20.55 22.44 25.37 27.13 29.45 30.10 30.96 34.06 36.42 38.09 39.13 39.99 ...
       41.93 44.59 47.30 52.89 55.73 56.76 59.17 60.63];%机动车数(单位：万辆)
x2=[0.6 0.75 0.85 0.9 1.05 1.35 1.45 1.6 1.7 1.85 2.15 2.2 2.25 2.35 2.5 2.6...
        2.7 2.85 2.95 3.1];%公路面积(单位：万平方公里)
x3=[0.09 0.11 0.11 0.14 0.20 0.23 0.23 0.32 0.32 0.34 0.36 0.36 0.38 0.49 ... 
         0.56 0.59 0.59 0.67 0.69 0.79];%公路客运量(单位：万人)
y1=[5126 6217 7730 9145 10460 11387 12353 15750 18304 19836 21024 19490 20433 ...
        22598 25107 33442 36836 40548 42927 43462];%公路货运量(单位：万吨)
y2=[1237 1379 1385 1399 1663 1714 1834 4322 8132 8936 11099 11203 10524 11115 ...
        13320 16762 18673 20724 20803 21804];
p=[x1;x2;x3];  %输入数据矩阵
t=[y1;y2];           %目标数据矩阵
[pp,ps1]=mapminmax(p);%归一化
[tt,ps2]=mapminmax(t)
alpha=0.005;%学习速率
o0=pp;
w1=rand(3,3);

w2=rand(3,3);

w3=rand(2,3);

error=20000;
while error>10000
    a1=w1*o0;
    o1=1./(1+exp(-a1));%输入层到第一隐含层
    a2=w2*o1;
    o2=1./(1+exp(-a2));%第一到第二隐含层
    a3=w3*o2;
    o3=2./(1+exp(-a3))-1;%第二隐含层到输出层
    for i=1:50000%反复调整训练
es3=(o3-tt).*((2*exp(-a3))./(1+exp(-a3)).^2);
dw3=es3*o2';
w3=w3-alpha*dw3;%输出层到第二隐含层误差负向反馈
es2=(w3'*es3).*(exp(-a2)./(1+exp(-a2)).^2);
dw2=es2*o1';
w2=w2-alpha*dw2;%第二隐含层到第一隐含层误差负向反馈
es1=(w2'*es2).*(exp(-a1)./(1+exp(-a1)).^2);
dw1=es1*o0';
w1=w1-alpha*dw1;%第一隐含层到输入层
a1=w1*o0;o1=1./(1+exp(-a1));
a2=w2*o1;o2=1./(1+exp(-a2));
a3=w3*o2;o3=(2./(1+exp(-a3)))-1;
    end
re=mapminmax('reverse',a3,ps2);
error=sum(abs(t-re)')./20
end

tt=1:20;
scatter(tt,y1);
hold on
plot(tt,re(1,:))
